Revit 2026 API

# FormatOptionsIsValidAccuracy(ForgeTypeId, Double) Method

---

Checks whether an accuracy is valid for a given unit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidAccuracy(
	ForgeTypeId unitTypeId,
	double accuracy
)
```
```vb
Public Shared Function IsValidAccuracy (
	unitTypeId As ForgeTypeId,
	accuracy As Double
) As Boolean
```
```cpp
public:
static bool IsValidAccuracy(
	ForgeTypeId^ unitTypeId,
	double accuracy
)
```
```fsharp
static member IsValidAccuracy :
        unitTypeId : ForgeTypeId *
        accuracy : float -> bool
```

#### Parameters

unitTypeId ForgeTypeId
     Identifier of the unit.
accuracy Double
     The accuracy to check.

#### Return Value

Boolean True if the accuracy is valid, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType). |
| ArgumentNullException | A non-optional argument was null |

See the Accuracy property for details on valid accuracy values.

#### Reference

FormatOptions Class

IsValidAccuracy Overload

Autodesk.Revit.DB Namespace